#![allow(dead_code)]

use std::error;
use std::fmt;

pub type Result<T> = std::result::Result<T, ParseError>;

#[derive(Clone, Debug)]
pub enum ParseError {
    RowOut,
    ColOut,
    IndexOut,
    StringParse,
    RecordTypeError,
}

impl fmt::Display for ParseError {
    fn fmt(&self, f: &mut fmt::Formatter) -> fmt::Result {
        write!(f, "invalid value(kind: {:?}) to coord.", self)
    }
}

impl error::Error for ParseError {
    fn source(&self) -> Option<&(dyn error::Error + 'static)> {
        None
    }
}

// use std::convert::TryInto;
use crate::coord::CoordPair;
// use crate::evaluation;
use crate::manual;

fn read_bytes(input: &mut &[u8], size: usize) -> Vec<u8> {
    let (bytes, rest) = input.split_at(size);
    *input = rest;

    bytes.to_vec()
}

pub fn write_coordpair(output: &mut Vec<u8>, coordpair: &CoordPair) {
    let (frow, fcol, trow, tcol) = coordpair.row_col();
    output.append(&mut vec![frow as u8, fcol as u8, trow as u8, tcol as u8]);
}

pub fn write_be_u32(output: &mut Vec<u8>, size: u32) {
    output.append(&mut size.to_be_bytes().to_vec());
}

pub fn write_string(output: &mut Vec<u8>, string: &str) {
    write_be_u32(output, string.len() as u32);
    output.append(&mut string.as_bytes().to_vec());
}

pub fn read_coordpair(input: &mut &[u8]) -> CoordPair {
    let bytes = read_bytes(input, 4);
    CoordPair::from_row_col(
        bytes[0] as usize,
        bytes[1] as usize,
        bytes[2] as usize,
        bytes[3] as usize,
    )
    .unwrap()
}

pub fn read_be_u32(input: &mut &[u8]) -> u32 {
    let bytes = read_bytes(input, std::mem::size_of::<u32>());
    u32::from_be_bytes(bytes.try_into().unwrap())
}

pub fn read_string(input: &mut &[u8]) -> String {
    let size = read_be_u32(input) as usize;
    let bytes = read_bytes(input, size);

    String::from_utf8(bytes.try_into().unwrap()).unwrap()
}

pub fn get_filename_manuals() -> Vec<(&'static str, &'static str, manual::Manual)> {
    let mut filename_manuals = Vec::<(&str, &str, manual::Manual)>::new();
    for (file_name, manual_str) in FILE_NAME_MANUAL_STRINGS {
        if let Ok(manual) = manual::Manual::from_filename(&format!("tests/xqf/{file_name}.xqf")) {
            filename_manuals.push((file_name, manual_str, manual));
        }
    }

    filename_manuals
}

pub const FILE_NAME_MANUAL_STRINGS:[(&str,&str);5] = [
            ("01","[Atype: 残局]
[Author: ]
[Black: ]
[Date: ]
[FEN: 5a3/4ak2r/6R2/8p/9/9/9/B4N2B/4K4/3c5 r - - 0 1]
[Game: ]
[Opening: ]
[Red: ]
[Site: ]
[Title: 第01局]
[Version: 18]
[Win: 红胜]
[Writer: ]

(2)
(7,5)(5,6){从相肩进马是取胜的正确途径。其它着法，均不能取胜。}(4)
(7,5)(5,4)(1)
(9,3)(0,3)(1)
(9,3)(2,3)(1)
(1,4)(2,5)(1)
(3,8)(4,8)(1)
(9,3)(0,3)(1)
(5,6)(4,4){不怕黑炮平中拴链，进观的攻势含蓄双有诱惑性，是红方制胜的关键。}(1)
(5,6)(4,4)(2)
(5,6)(3,7){叫杀得车。}
(5,6)(4,4)(1)
(5,4)(4,6)(1)
(0,3)(0,4)(1)
(2,3)(2,4)(1)
(1,8)(1,7)(1)
(1,8)(3,8)(1)
(0,3)(0,4)(1)
(2,6)(2,5){弃车，与前着相联系，由此巧妙成杀。}(1)
(4,4)(3,6)
(2,6)(2,5)(1)
(2,6)(1,6)
(8,4)(8,3)(1)
(1,4)(2,5)(1)
(1,4)(2,5)(2)
(1,8)(1,7)(1)
(4,4)(3,6)
(4,4)(3,6)
(4,4)(2,3)
(4,6)(2,7)(1)
(1,7)(2,7)(1)
(2,6)(2,7)(1)
(1,4)(0,3)(1)
(2,7)(1,7)(1)
(1,5)(2,5){至此，形成少见的高将底炮双士和单车的局面。}(1)
(1,7)(3,7)(1)
(0,5)(1,4)(1)
(3,7)(3,5)(1)
(2,5)(2,4)(1)
(3,5)(3,8)(1)
(2,4)(2,5)(1)
(3,8)(3,5)(1)
(2,5)(2,4)(1)
(8,3)(9,3)(1)
(0,4)(0,5){和棋。}
"),
            ("4四量拨千斤","[Atype: 全局]
[Author: 橘子黄了]
[Black: ]
[Date: ]
[FEN: rnbakabnr/9/1c5c1/p1p1p1p1p/9/9/P1P1P1P1P/1C5C1/9/RNBAKABNR r - - 0 1]
[Game: ]
[Opening: ]
[Red: ]
[Site: ]
[Title: 四量拨千斤]
[Version: 10]
[Win: 未知]
[Writer: 阎文清 张强]

(1)
(7,7)(7,4)(1)
(0,1)(2,2)(1)
(9,7)(7,6)(1)
(2,7)(2,5)(1)
(9,8)(9,7)(1)
(0,7)(2,6)(1)
(9,1)(7,0)(1)
(3,6)(4,6){红方左马屯边，是一种老式的攻法，优点是大子出动速度较快，不利之处是双马位置欠佳，易成弱点。

黑方挺卒活马，应着稳正，是对付红方边马阵形的有效战术。}(1)
(7,1)(7,2){平炮七线，意在加强对黑方3路线的压力，但阵营不够稳固，容易给黑方提供骚扰反击的机会。如改走炮八平六，则相对来讲要稳健一些。}(1)
(2,6)(4,5){黑方迅即跃马，有随时马6进4入侵的手段，是一种牵制战术。此外另有车1平2的选择，以下形成车九平八，炮2进4，车二进六，各攻一翼之势。}(1)
(9,0)(9,1)(1)
(2,1)(2,0){当然之着，可摆脱红车的牵制。如果走车1平2，则车八进四，黑方因单马护守中卒而不能炮2平1自然邀兑。红方占优。}(1)
(6,6)(5,6){带有欺骗性的弃兵，意在强行打开局面，实施快攻战术。通常红方多走车八进四或车二进四。}(1)
(4,6)(5,6){黑方去兵，当仁不让。如改走马6进4，红将兵三进一！马4进3，车八进二，炮6进5，马三进四，黑方得子受攻，形势不利。}(1)
(9,1)(5,1){如图形势，面对红方的捉卒，黑方主要有两种应着：（甲）卒7进1；（乙）卒7平8。现分述如下：}(2)
(5,6)(6,6){冲卒捉马，看起来是一步绝对先手，但却流于习俗，正为红方所算。}(1)
(5,6)(5,7){平卒拦车，意在延缓红方攻势，取舍异常果断，有“四两拨千斤”之妙！}(1)
(9,7)(4,7){！
进车捉马，战术紧逼，乃预谋的攻着。}(1)
(7,6)(5,7)(1)
(6,6)(7,6){另有两种选择：(1)马6退7，车二平三，车9进2，车三退二，红方主动；(2)马6退5，马三退一，黑方虽有一卒过河，但阵形呆滞，红方占有主动。}(1)
(0,8)(0,7){佳着，可顺势抢先。}(1)
(4,7)(4,5)(1)
(9,7)(7,7){高车生根，可立即迫兑黑方河口马，着法及时，否则纠缠下去于红方无益。}(1)
(0,3)(1,4)(1)
(0,7)(5,7)(1)
(6,2)(5,2){依仗出子优势，红方继续贯彻强攻计划。若改走炮七平三，则象3进5，局面较为平稳，红方略占先手。}(1)
(7,7)(5,7)(1)
(0,2)(2,4)(1)
(4,5)(5,7)(1)
(5,2)(4,2){！}(1)
(5,1)(5,7)(1)
(3,2)(4,2){对黑方消极的象5进3，红有马九进七下伏马七进六或马七进五等手段，将全线出击。}(1)
(0,2)(2,4){经过转换，烟消云散，双方趋于平稳。}(1)
(7,2)(2,2)(1)
(6,0)(5,0)(1)
(2,5)(2,2)(1)
(0,3)(1,4){补士固防，稳正之着，当然不宜走卒3进1，否则红将兵七进一乘势进攻。}(1)
(7,4)(3,4)(1)
(7,2)(3,2)(1)
(2,2)(9,2)(1)
(3,8)(4,8){细致的一手，不给红方炮七平一打卒的机会。}(1)
(9,3)(8,4){红方持有中炮攻势，占有优势。}
(7,0)(5,1)(1)
(0,0)(0,3){双方大致均势。


［小结］对于红方所施的骗着，黑方（甲）变不够明智，遭到了红方的猛攻，处境不妙。（乙）变黑方妙用平卒巧着，有效地遏制了红方攻势，双方平分秋色。

在本局中。红方的布局骗着具有快速突击的特点。对此，黑方愈是用强，红势则愈旺。黑若能冷静对待，并采取（乙）变着法，延缓红势的策略，可安然无恙。}
"),
            ("第09局","[Atype: 残局]
[Author: ]
[Black: ]
[Date: ]
[FEN: 5k3/9/9/9/9/9/4rp3/2R1C4/4K4/9 r - - 0 1]
[Game: ]
[Opening: ]
[Red: ]
[Site: ]
[Title: 第09局]
[Version: 18]
[Win: 红胜]
[Writer: ]

{这是一局炮斗车卒的范例。对车炮的运用颇有启迪，可资借鉴。}(1)
(7,2)(5,2)(3)
(6,4)(6,0)(2)
(6,4)(6,3)(1)
(6,4)(1,4)(1)
(7,4)(7,5){献炮叫将，伏车八平四白脸将成杀，是获胜的关键。}(1)
(7,4)(7,7)(1)
(5,2)(5,4){红车占中是获胜的休着。黑不敢平车邀兑，否则，红车五平四胜。}(1)
(5,2)(5,7)(1)
(6,5)(6,4)(1)
(6,0)(6,4){将军。}(1)
(0,5)(1,5)(1)
(1,4)(1,6)(1)
(5,2)(5,5)(1)
(7,7)(7,4){叫杀。}(1)
(7,4)(7,5)(1)
(5,7)(0,7){红方升车再打将，使黑方车卒失去有机联系，是获胜的重要环节。}(1)
(0,5)(0,4)(1)
(6,4)(6,0)(1)
(6,5)(6,4)(1)
(0,5)(1,5)(1)
(5,5)(5,4)(2)
(7,4)(7,7){“二打对一打”，红方不变作负。}
(7,5)(7,6)(1)
(0,7)(6,7)(3)
(0,4)(0,5)(1)
(0,4)(0,3)(1)
(1,5)(0,5)(1)
(6,5)(6,6)(1)
(1,6)(6,6)(1)
(6,5)(7,5)(1)
(7,5)(7,6)(1)
(7,5)(6,5)(1)
(7,6)(6,6)(1)
(6,7)(5,7)(1)
(7,4)(7,5)(1)
(6,7)(6,5)(1)
(0,5)(1,5)(1)
(6,0)(8,0)(1)
(6,4)(7,4)(1)
(1,5)(0,5)(1)
(6,5)(7,5)(1)
(1,5)(1,4)(1)
(7,6)(6,6)(1)
(8,4)(9,4)(1)
(5,4)(7,4){红方胜定。}
(5,7)(5,5)(1)
(6,7)(6,6)
(6,5)(7,5){以下升车占中，海底捞月胜。}
(6,0)(8,0){平炮再升炮打车，消灭小卒，催毁黑方中路屏障，是红方获胜的精华。}(1)
(8,0)(8,3)(1)
(0,5)(0,4)(1)
(8,4)(9,4)(1)
(5,4)(6,4)(1)
(5,5)(5,4)(1)
(8,0)(8,5)(1)
(8,3)(7,3)(1)
(0,4)(0,3)(1)
(5,4)(6,4)(1)
(6,4)(0,4)(1)
(7,4)(7,3){红方胜定。}
(8,5)(7,5)(1)
(0,3)(1,3)(1)
(6,6)(0,6)(1)
(6,5)(6,2){以下海底捞月红胜。}
(7,5)(2,5)(1)
(6,4)(1,4)(1)
(1,5)(0,5)(1)
(1,4)(0,4)(1)
(0,5)(1,5)(1)
(0,6)(0,5)(1)
(2,5)(2,6)(1)
(0,4)(4,4)(1)
(1,5)(0,5)(1)
(4,4)(4,5)
"),
            ("布局陷阱--飞相局对金钩炮","[Atype: 全局]
[Author: ]
[Black: ]
[Date: ]
[FEN: rnbakabnr/9/1c5c1/p1p1p1p1p/9/9/P1P1P1P1P/1C5C1/9/RNBAKABNR r - - 0 1]
[Game: 布局陷阱--飞相局对金钩炮]
[Opening: ]
[Red: ]
[Site: ]
[Title: 布局陷阱--飞相局对金钩炮]
[Version: 12]
[Win: 红胜]
[Writer: ]

(1)
(9,6)(7,4)(1)
(2,7)(2,2)(1)
(9,8)(8,8)(1)
(0,7)(2,6)(1)
(8,8)(8,3)(1)
(0,8)(0,7)(1)
(8,3)(1,3)(1)
(0,1)(2,0)(1)
(1,3)(1,1)(1)
(2,1)(9,1)(1)
(9,0)(9,1)(1)
(0,6)(2,4)(1)
(7,1)(7,0)(1)
(0,5)(1,4)(1)
(9,1)(2,1)(1)
(2,2)(2,3)(1)
(9,7)(8,5)(1)
(0,7)(4,7)(1)
(6,0)(5,0)(1)
(2,3)(3,3)(1)
(1,1)(1,3)(1)
(3,3)(2,3)(1)
(7,0)(3,0)(1)
(2,0)(0,1)(1)
(3,0)(4,0)(1)
(4,7)(4,5)(1)
(8,5)(9,7)(1)
(3,6)(4,6)(1)
(1,3)(1,1){红得子大优}
"),
            ("- 北京张强 (和) 上海胡荣华 (1993.4.27于南京)","[Atype: 全局]
[Author: ]
[Black: 上海胡荣华]
[Date: 1993.4.27]
[FEN: rnbakabnr/9/1c5c1/p1p1p1p1p/9/9/P1P1P1P1P/1C5C1/9/RNBAKABNR r - - 0 1]
[Game: 93全国象棋锦标赛]
[Opening: ]
[Red: 北京张强]
[Site: 南京]
[Title: 挺兵对卒底炮]
[Version: 13]
[Win: 和棋]
[Writer: ]

(1)
(6,2)(5,2)(1)
(2,1)(2,2)(1)
(7,7)(7,4)(1)
(0,2)(2,4)(1)
(9,7)(7,6)(1)
(3,2)(4,2)(1)
(9,1)(7,0)(1)
(4,2)(5,2)(1)
(9,8)(9,7)(1)
(0,8)(1,8)(1)
(9,0)(9,1)(1)
(1,8)(1,3)(1)
(9,3)(8,4)(1)
(0,3)(1,4)(1)
(9,7)(5,7)(1)
(3,6)(4,6)(1)
(5,7)(5,2)(1)
(0,7)(2,6)(1)
(6,6)(5,6)(1)
(4,6)(5,6)(1)
(5,2)(5,6)(1)
(3,0)(4,0)(1)
(7,1)(7,3)(1)
(0,1)(2,0)(1)
(9,1)(2,1)(1)
(2,6)(4,5)(1)
(2,1)(3,1)(1)
(1,3)(5,3)(1)
(5,6)(5,5)(1)
(2,7)(2,6)(1)
(9,6)(7,8)(1)
(5,3)(4,3)(1)
(7,4)(3,4)(1)
(4,3)(4,2)(1)
(9,2)(7,4)(1)
(0,0)(0,1)(1)
(3,1)(0,1)(1)
(2,0)(0,1)(1)
(7,6)(5,7)(1)
(4,5)(5,7)(1)
(5,5)(5,7)(1)
(2,2)(0,2)(1)
(5,7)(5,6)(1)
(0,2)(2,2)(1)
(6,0)(5,0)(1)
(0,1)(1,3)(1)
(3,4)(3,5)(1)
(4,2)(4,5)(1)
(3,5)(3,7)(1)
(1,3)(3,4)(1)
(5,6)(5,1)(1)
(4,0)(5,0)(1)
(5,1)(5,0)(1)
(3,4)(4,2)(1)
(5,0)(0,0)(1)
(2,2)(0,2)(1)
(7,0)(6,2)(1)
(4,5)(4,4)(1)
(6,4)(5,4)(1)
(4,2)(5,4)
"),
        ];
